In [1]:
import numpy as np
import pandas as pd

In [67]:
df = pd.DataFrame({'col1': [1,2,3,4],
                  'col2': [111,222,111,333],
                  'col3':['abc','def','ghi','xyz']})

df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   111  ghi
3     4   333  xyz

In [69]:
#finding unique values
df['col2'].unique()

array([111, 222, 333], dtype=int64)

In [71]:
df['col2'].nunique() #provide the number of unique values

3

In [73]:
df['col2'].value_counts() #count the unique values

col2
111    2
222    1
333    1
Name: count, dtype: int64

In [75]:
#Selecting Data, conditional selection
df[df['col1']>1]

   col1  col2 col3
1     2   222  def
2     3   111  ghi
3     4   333  xyz

In [77]:
df[ (df['col1']>1) & (df['col2'] == 222)] #multiple conditional statements

   col1  col2 col3
1     2   222  def

In [79]:
#Apply method: For applying user defined funtions on data
def addfive(x):
    return x+5

In [81]:
df['col1'].apply(addfive)

0    6
1    7
2    8
3    9
Name: col1, dtype: int64

In [83]:
df

   col1  col2 col3
0     1   111  abc
1     2   222  def
2     3   111  ghi
3     4   333  xyz

In [85]:
df['col3'].apply(len) #we can also apply built-in functions

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [87]:
df['col2'].apply(lambda x: x*2) #Lambda expressions can also be used in apply

0    222
1    444
2    222
3    666
Name: col2, dtype: int64

In [89]:
df['col2'].apply(lambda x: x/2)

0     55.5
1    111.0
2     55.5
3    166.5
Name: col2, dtype: float64

In [91]:
#Dropping col1
df.drop('col1', axis = 1) #to save changes we have to use inplace

   col2 col3
0   111  abc
1   222  def
2   111  ghi
3   333  xyz

In [93]:
#info
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [95]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [97]:
#sorting 
df.sort_values('col2')

   col1  col2 col3
0     1   111  abc
2     3   111  ghi
1     2   222  def
3     4   333  xyz

In [99]:
#Finding nulls
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [103]:
#Pivot Table

data = { 'A': ['foo','foo','foo','bar','bar','bar'],
        'B': ['one ','one','two','two','one','one'],
        'C': ['x','y','x','y','x','y'],
        'D': [1,3,2,5,4,1]
}

df = pd.DataFrame(data)
df

     A     B  C  D
0  foo  one   x  1
1  foo   one  y  3
2  foo   two  x  2
3  bar   two  y  5
4  bar   one  x  4
5  bar   one  y  1

In [109]:
df.pivot_table(values = 'D', index = ['A', 'B'], columns = 'C') #pivot table is a multi index table

C           x    y
A   B
bar one   4.0  1.0
    two   NaN  5.0
foo one   NaN  3.0
    one   1.0  NaN
    two   2.0  NaN